УТ_для_edt/src/Documents/смартБонусыЗаМаркетинговыеМероприятия/смартБонусыЗаМаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартБонусыЗаМаркетинговыеМероприятия</name>
  <comment>#6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <registerRecords>AccumulationRegister.смартБонусыЗаМаркетинговыеМероприятия</registerRecords>
  <attributes>
    <name>ПроцентНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Бонусы</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркетинговоеМероприятие</name>
      <type>
        <types>DocumentRef.МаркетинговыеМероприятияДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыручки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/AccumulationRegisters/смартБонусыЗаМаркетинговыеМероприятия/смартБонусыЗаМаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>смартБонусыЗаМаркетинговыеМероприятия</name>
  <comment>#6224 смарт: Тимофеева 13.04.2026 / Расчет бонусов инженеров за маркетинговые мероприятия</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>DocumentRef.МаркетинговыеМероприятияДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/СтатусыЗаказовКлиентов/СтатусыЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовКлиентов</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартБонусыЗаМаркетинговыеМероприятия/Forms/ФормаДокумента/Module.bsl
/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПроцентНачисления = Справочники.смартПредопределенныеЗначения.ПроцентНачисленияДляРасчетаБонусовИнженеровПоМаркетинговымМероприятиям.Значение;
		Если НЕ ЗначениеЗаполнено(Объект.ПроцентНачисления) Тогда
			Объект.ПроцентНачисления = 0.5;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроцентНачисленияПриИзменении(Элемент)
	Если Объект.Бонусы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕдиныйПроцентНачисленияВСтроках() Тогда
		Оповещение = Новый ОписаниеОповещения("ПроцентНачисленияПриИзмененииЗавершить", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, СтрШаблон("В строках есть разные проценты начисления? Пересчитать все бонусы с %1%%?", Объект.ПроцентНачисления), РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ПересчитатьТаблицуБонусов();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБонусы

&НаКлиенте
Процедура БонусыПроцентНачисленияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Бонусы.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.СуммаБонуса = ТекущиеДанные.СуммаВыручки * ТекущиеДанные.ПроцентНачисления * 0.01;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьРасчет(Команда)  
	Если Объект.Бонусы.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнитьРасчет", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Таблица бонусов будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ЗаполнитьРасчетНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполнитьРасчет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьРасчетНаСервере();
	КонецЕсли;
КонецПроцедуры

//++ #7450 смарт: Тимофеева 23.07.2026 / Один интерес - несколько ММ
&НаСервере
Процедура ЗаполнитьРасчетНаСервереУстар()
//&НаСервере
//Процедура ЗаполнитьРасчетНаСервере()
//-- #7450 смарт: Тимофеева 23.07.2026
	Объект.Бонусы.Очистить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляРасчетаБонусов();
	
	Запрос.УстановитьПараметр("ДатаЗакрытия", Объект.Дата);  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТипыМероприятий = Справочники.смартПредопределенныеЗначения.ТипыМаркетинговыхМероприятийДляРасчетаБонусовИнженеров.Значения.Выгрузить().ВыгрузитьКолонку("Значение");
	Запрос.УстановитьПараметр("ТипыМероприятий", ТипыМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Инженер) Тогда
			НоваяСтрока = Объект.Бонусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ПроцентНачисления = Объект.ПроцентНачисления;
			НоваяСтрока.СуммаБонуса = Окр(НоваяСтрока.СуммаВыручки * НоваяСтрока.ПроцентНачисления * 0.01, 0);
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;	
КонецПроцедуры     

&НаСервере
Функция ПолучитьТекстЗапросаДляРасчетаБонусов()	
	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_Интерес.Ссылка КАК Интерес,
	|	CRM_Интерес.смартМаркетинговоеМероприятие КАК МаркетинговоеМероприятие
	|ПОМЕСТИТЬ ВТ_ИнтересыИМаркетинговыеМероприятия
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.смартБонусыЗаМаркетинговыеМероприятия.Обороты(, , Запись, ) КАК смартБонусыЗаМаркетинговыеМероприятияОбороты
	|		ПО CRM_Интерес.смартМаркетинговоеМероприятие = смартБонусыЗаМаркетинговыеМероприятияОбороты.МаркетинговоеМероприятие
	|			И (НЕ смартБонусыЗаМаркетинговыеМероприятияОбороты.Регистратор = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|		ПО CRM_Интерес.смартМаркетинговоеМероприятие = МаркетинговыеМероприятияДокумент.Ссылка
	|			И (МаркетинговыеМероприятияДокумент.ТипМероприятия В (&ТипыМероприятий))
	|ГДЕ
	|	смартБонусыЗаМаркетинговыеМероприятияОбороты.Инженер ЕСТЬ NULL
	|	И НЕ CRM_Интерес.смартМаркетинговоеМероприятие = ЗНАЧЕНИЕ(Документ.МаркетинговыеМероприятияДокумент.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнтересыИМаркетинговыеМероприятия.Интерес КАК Интерес,
	|	ВТ_ИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Оборудование КАК Оборудование,
	|	МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.смартИсполнитель КАК ИнженерФизЛицо,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.КоличествоИсполнителей ЕСТЬ NULL
	|			ТОГДА 1 / ВложенныйЗапрос.КоличествоИсполнителей
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Коэффициент,
	|	демоОборудованиеДляДемонстрации.Номенклатура.смартМодельныйРяд КАК МодельныйРяд
	|ПОМЕСТИТЬ ВТ_Оборудование
	|ИЗ
	|	ВТ_ИнтересыИМаркетинговыеМероприятия КАК ВТ_ИнтересыИМаркетинговыеМероприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркетинговыеМероприятияДокумент.ОборудованиеДляДемонстрацииИнженер КАК МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.демоОборудованиеДляДемонстрации КАК демоОборудованиеДляДемонстрации
	|			ПО МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Оборудование = демоОборудованиеДляДемонстрации.Ссылка
	|		ПО ВТ_ИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие = МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Ссылка КАК Ссылка,
	|			МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Оборудование КАК Оборудование,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.смартИсполнитель) КАК КоличествоИсполнителей
	|		ИЗ
	|			Документ.МаркетинговыеМероприятияДокумент.ОборудованиеДляДемонстрацииИнженер КАК МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер
	|		
	|		СГРУППИРОВАТЬ ПО
	|			МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Ссылка,
	|			МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Оборудование) КАК ВложенныйЗапрос
	|		ПО ВТ_ИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие = ВложенныйЗапрос.Ссылка
	|			И (МаркетинговыеМероприятияДокументОборудованиеДляДемонстрацииИнженер.Оборудование = ВложенныйЗапрос.Оборудование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оборудование.ИнженерФизЛицо КАК ИнженерФизЛицо,
	|	ЕСТЬNULL(МАКСИМУМ(Пользователи.Ссылка), ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Инженер
	|ПОМЕСТИТЬ ВТ_Инженеры
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ВТ_Оборудование.ИнженерФизЛицо = Пользователи.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оборудование.ИнженерФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ЖурналДокументов.CRM_Интерес КАК Интерес,
	|	CRM_ЖурналДокументов.Объект КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО CRM_ЖурналДокументов.Объект = ЗаказКлиента.Ссылка
	|			И (ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт))
	|			И (ЗаказКлиента.ДатаЗакрытия <= &ДатаЗакрытия)
	|ГДЕ
	|	CRM_ЖурналДокументов.CRM_Интерес В
	|			(ВЫБРАТЬ
	|				ВТ.Интерес
	|			ИЗ
	|				ВТ_ИнтересыИМаркетинговыеМероприятия КАК ВТ)
	|	И CRM_ЖурналДокументов.ГлавнаяЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Интерес КАК Интерес,
	|	Продажи.ЗаказКлиента КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Продажи.СуммаВыручкиРеглОборот КАК СуммаВыручки,
	|	Номенклатура.смартМодельныйРяд КАК смартМодельныйРяд
	|ПОМЕСТИТЬ ВТ_ПродажиПоИнтересам
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					ВТ.ЗаказКлиента
	|				ИЗ
	|					ВТ_Заказы КАК ВТ)) КАК Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Продажи.АналитикаУчетаНоменклатуры.Номенклатура = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО Продажи.ЗаказКлиента = ВТ_Заказы.ЗаказКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Инженеры.Инженер КАК Инженер,
	|	ВТ_Оборудование.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	ВТ_ПродажиПоИнтересам.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ПродажиПоИнтересам.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиПоИнтересам.СуммаВыручки * ВТ_Оборудование.Коэффициент КАК СуммаВыручки
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПродажиПоИнтересам КАК ВТ_ПродажиПоИнтересам
	|		ПО ВТ_Оборудование.МодельныйРяд = ВТ_ПродажиПоИнтересам.смартМодельныйРяд
	|			И (НЕ ВТ_Оборудование.МодельныйРяд = ЗНАЧЕНИЕ(Справочник.смартМодельныеРядыНоменклатуры.ПустаяСсылка))
	|			И ВТ_Оборудование.Интерес = ВТ_ПродажиПоИнтересам.Интерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Инженеры КАК ВТ_Инженеры
	|		ПО ВТ_Оборудование.ИнженерФизЛицо = ВТ_Инженеры.ИнженерФизЛицо";		
КонецФункции  

&НаСервере
Функция ЕдиныйПроцентНачисленияВСтроках()
	ТаблицаПроцентНачисления = Объект.Бонусы.Выгрузить(,"ПроцентНачисления");
	ТаблицаПроцентНачисления.Свернуть("ПроцентНачисления");
	Возврат ТаблицаПроцентНачисления.Количество() < 2;
КонецФункции

&НаКлиенте
Процедура ПересчитатьТаблицуБонусов()
	Для Каждого Строка Из Объект.Бонусы Цикл
		Строка.ПроцентНачисления = Объект.ПроцентНачисления;
		Строка.СуммаБонуса = Окр(Строка.СуммаВыручки * Строка.ПроцентНачисления * 0.01, 0);
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНачисленияПриИзмененииЗавершить(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьТаблицуБонусов();
	КонецЕсли;
КонецПроцедуры

//++ #7450 смарт: Тимофеева 23.07.2026 / Один интерес - несколько ММ 
//Коэффициент считаем отдельно по количеству строк различных исполнителей и ММ
&НаСервере
Процедура ЗаполнитьРасчетНаСервере()
	Объект.Бонусы.Очистить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДляРасчетаБонусовБезКоэффициентов();
	
	Запрос.УстановитьПараметр("ДатаЗакрытия", Объект.Дата);  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТипыМероприятий = Справочники.смартПредопределенныеЗначения.ТипыМаркетинговыхМероприятийДляРасчетаБонусовИнженеров.Значения.Выгрузить().ВыгрузитьКолонку("Значение");
	Запрос.УстановитьПараметр("ТипыМероприятий", ТипыМероприятий);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаТаблицыРезультата Из ТаблицаРезультата Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыРезультата.Инженер) Тогда
			НоваяСтрока = Объект.Бонусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыРезультата);
			
			Отбор = Новый Структура("ЗаказКлиента,Номенклатура,СуммаВыручки");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицыРезультата);
			НайденныеСтроки = ТаблицаРезультата.НайтиСтроки(Отбор);
			НоваяСтрока.СуммаВыручки = СтрокаТаблицыРезультата.СуммаВыручки / НайденныеСтроки.Количество(); 
			
			НоваяСтрока.ПроцентНачисления = Объект.ПроцентНачисления;
			НоваяСтрока.СуммаБонуса = Окр(НоваяСтрока.СуммаВыручки * НоваяСтрока.ПроцентНачисления * 0.01, 0);
		КонецЕсли;
		
	КонецЦикла;
		
	Модифицированность = Истина;	
КонецПроцедуры     

&НаСервере
Функция ПолучитьТекстЗапросаДляРасчетаБонусовБезКоэффициентов()	
	Возврат 
	"ВЫБРАТЬ
	|	CRM_Интерес.Ссылка КАК Интерес,
	|	МаркетинговыеМероприятияДокумент.Ссылка КАК МаркетинговоеМероприятие
	|ПОМЕСТИТЬ ВТ_ВсеИнтересыИМаркетинговыеМероприятия
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_Интерес КАК CRM_Интерес
	|		ПО МаркетинговыеМероприятияДокумент.Ссылка.смартИнтерес = CRM_Интерес.Ссылка
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.Ссылка.ТипМероприятия В(&ТипыМероприятий)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	CRM_Интерес.Ссылка,
	|	МаркетинговыеМероприятияДокумент.Ссылка
	|ИЗ
	|	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_Интерес КАК CRM_Интерес
	|		ПО МаркетинговыеМероприятияДокумент.Ссылка = CRM_Интерес.смартМаркетинговоеМероприятие
	|ГДЕ
	|	МаркетинговыеМероприятияДокумент.Ссылка.ТипМероприятия В(&ТипыМероприятий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеИнтересыИМаркетинговыеМероприятия.Интерес КАК Интерес,
	|	ВТ_ВсеИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие
	|ПОМЕСТИТЬ ВТ_ИнтересыИМаркетинговыеМероприятия
	|ИЗ
	|	ВТ_ВсеИнтересыИМаркетинговыеМероприятия КАК ВТ_ВсеИнтересыИМаркетинговыеМероприятия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИнтересыИМаркетинговыеМероприятия.Интерес КАК Интерес,
	|	ВТ_ИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	ОборудованиеДляДемонстрацииИнженер.смартИсполнитель КАК ИнженерФизЛицо,
	|	ОборудованиеДляДемонстрацииИнженер.Оборудование КАК Оборудование,
	|	демоОборудованиеДляДемонстрации.Номенклатура.смартМодельныйРяд КАК МодельныйРяд
	|ПОМЕСТИТЬ ВТ_ОборудованиеМаркетинговыхМероприятий
	|ИЗ
	|	ВТ_ИнтересыИМаркетинговыеМероприятия КАК ВТ_ИнтересыИМаркетинговыеМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаркетинговыеМероприятияДокумент.ОборудованиеДляДемонстрацииИнженер КАК ОборудованиеДляДемонстрацииИнженер
	|		ПО ВТ_ИнтересыИМаркетинговыеМероприятия.МаркетинговоеМероприятие = ОборудованиеДляДемонстрацииИнженер.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.демоОборудованиеДляДемонстрации КАК демоОборудованиеДляДемонстрации
	|		ПО (ОборудованиеДляДемонстрацииИнженер.Оборудование = демоОборудованиеДляДемонстрации.Ссылка)
	|ГДЕ
	|	НЕ демоОборудованиеДляДемонстрации.Номенклатура.смартМодельныйРяд = ЗНАЧЕНИЕ(Справочник.смартМодельныеРядыНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОборудованиеМаркетинговыхМероприятий.Интерес КАК Интерес,
	|	ВТ_ОборудованиеМаркетинговыхМероприятий.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	ВТ_ОборудованиеМаркетинговыхМероприятий.ИнженерФизЛицо КАК ИнженерФизЛицо,
	|	ВТ_ОборудованиеМаркетинговыхМероприятий.МодельныйРяд КАК МодельныйРяд
	|ПОМЕСТИТЬ ВТ_МодельныйРядМаркетинговыхМероприятий
	|ИЗ
	|	ВТ_ОборудованиеМаркетинговыхМероприятий КАК ВТ_ОборудованиеМаркетинговыхМероприятий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ЖурналДокументов.CRM_Интерес КАК Интерес,
	|	CRM_ЖурналДокументов.Объект КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО CRM_ЖурналДокументов.Объект = ЗаказКлиента.Ссылка
	|			И (ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт))
	|			И (ЗаказКлиента.ДатаЗакрытия <= &ДатаЗакрытия)
	|ГДЕ
	|	CRM_ЖурналДокументов.CRM_Интерес В
	|			(ВЫБРАТЬ
	|				ВТ.Интерес
	|			ИЗ
	|				ВТ_ИнтересыИМаркетинговыеМероприятия КАК ВТ)
	|	И CRM_ЖурналДокументов.ГлавнаяЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МодельныйРядМаркетинговыхМероприятий.ИнженерФизЛицо КАК ИнженерФизЛицо,
	|	ЕСТЬNULL(МАКСИМУМ(Пользователи.Ссылка), ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Инженер
	|ПОМЕСТИТЬ ВТ_Инженеры
	|ИЗ
	|	ВТ_МодельныйРядМаркетинговыхМероприятий КАК ВТ_МодельныйРядМаркетинговыхМероприятий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ВТ_МодельныйРядМаркетинговыхМероприятий.ИнженерФизЛицо = Пользователи.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МодельныйРядМаркетинговыхМероприятий.ИнженерФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Интерес КАК Интерес,
	|	Продажи.ЗаказКлиента КАК ЗаказКлиента,
	|	Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	Продажи.СуммаВыручкиРеглОборот КАК СуммаВыручки,
	|	Номенклатура.смартМодельныйРяд КАК смартМодельныйРяд
	|ПОМЕСТИТЬ ВТ_ПродажиПоИнтересам
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			,
	|			,
	|			,
	|			ЗаказКлиента В
	|				(ВЫБРАТЬ
	|					ВТ.ЗаказКлиента
	|				ИЗ
	|					ВТ_Заказы КАК ВТ)) КАК Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Продажи.АналитикаУчетаНоменклатуры.Номенклатура = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО Продажи.ЗаказКлиента = ВТ_Заказы.ЗаказКлиента
	|ГДЕ
	|	НЕ Номенклатура.смартМодельныйРяд = ЗНАЧЕНИЕ(Справочник.смартМодельныеРядыНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МодельныйРядМаркетинговыхМероприятий.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
	|	ВТ_Инженеры.Инженер КАК Инженер,
	|	ВТ_ПродажиПоИнтересам.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_ПродажиПоИнтересам.Номенклатура КАК Номенклатура,
	|	ВТ_ПродажиПоИнтересам.СуммаВыручки КАК СуммаВыручки
	|ИЗ
	|	ВТ_МодельныйРядМаркетинговыхМероприятий КАК ВТ_МодельныйРядМаркетинговыхМероприятий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПродажиПоИнтересам КАК ВТ_ПродажиПоИнтересам
	|			ПО ВТ_МодельныйРядМаркетинговыхМероприятий.Интерес = ВТ_ПродажиПоИнтересам.Интерес
	|			И ВТ_МодельныйРядМаркетинговыхМероприятий.МодельныйРяд = ВТ_ПродажиПоИнтересам.смартМодельныйРяд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Инженеры КАК ВТ_Инженеры
	|			ПО ВТ_МодельныйРядМаркетинговыхМероприятий.ИнженерФизЛицо = ВТ_Инженеры.ИнженерФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.смартБонусыЗаМаркетинговыеМероприятия.Обороты(, , Авто, ) КАК смартБонусыЗаМаркетинговыеМероприятияОбороты
	|			ПО ВТ_МодельныйРядМаркетинговыхМероприятий.МаркетинговоеМероприятие = смартБонусыЗаМаркетинговыеМероприятияОбороты.МаркетинговоеМероприятие
	|			И ВТ_ПродажиПоИнтересам.ЗаказКлиента = смартБонусыЗаМаркетинговыеМероприятияОбороты.ЗаказКлиента
	|			И ВТ_ПродажиПоИнтересам.Номенклатура = смартБонусыЗаМаркетинговыеМероприятияОбороты.Номенклатура
	|			И (НЕ смартБонусыЗаМаркетинговыеМероприятияОбороты.Регистратор = &Ссылка)
	|ГДЕ
	|	смартБонусыЗаМаркетинговыеМероприятияОбороты.Инженер ЕСТЬ NULL
	|";		
КонецФункции 

//-- #7450 смарт: Тимофеева 23.07.2026

#КонецОбласти
